'''Дана строка. Замените в этой строке все цифры 1 на слово one.

Формат ввода

Вводится строка.

Формат вывода

Выведите ответ на задачу.
'''
text = input()
text = text.replace('1', 'one')
print(text)
