'''Дана строка. Удалите из этой строки все символы @.

Формат ввода

Вводится строка.

Формат вывода

Выведите ответ на задачу.
'''
text = input()
text = text.replace('@', '')
print(text)
